# -*- coding: utf-8 -*-
"""
Created on Fri Feb  2 12:07:49 2018

@author: Анастасия
"""

m = float(input('Ваш вес в кг: '))
h = float(input('Ваш рост в сантиметрах: '))
I = m // (h/100)**2
meaning = {1:'Выраженный дефицит массы тела', 2:'Недостаточная (дефицит) масса тела',3:'Норма',4:'Избыточная масса тела (предожирение)',5:'Ожирение первой степени',6:'	Ожирение второй степени',7:'	Ожирение третьей степени (морбидное)'}
a = 0
if I <= 16:
    a = 1
elif 16 <= I < 18.5:
    a = 2
elif 18.5 <= I <= 24.99:
    a = 3
elif 25 <= I < 30:
    a = 4
elif 30 <= I < 35:
    a = 5
elif 35 <= I < 40:
    a = 6
elif I >= 40:
    a = 7
print('ИМТ: %.1f' % I)
print('Интерпретация показателей ИМТ-', meaning[a])